In [2]:
%load_ext sql

In [3]:
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name?security=SSL
%sql ibm_db_sa://vlp83309:CXw07KDP8qg5RgPx@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb?security=SSL

'Connected: vlp83309@bludb'

In [4]:
%sql select * from sales limit 5;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[(10223, 37, Decimal('100.00'), 1, Decimal('3965.66'), '02/20/04 0:00', 'Shipped', 1, 2, 2004, 'Motorcycles', 95, 'S10_1678', 'Australian Collectors, Co.', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', 3004, 'Australia', 'APAC', 'Ferguson', 'Peter', 'Medium'),
 (10237, 23, Decimal('100.00'), 7, Decimal('2333.12'), '04/05/04 0:00', 'Shipped', 2, 4, 2004, 'Motorcycles', 95, 'S10_1678', 'Vitachrome Inc.', '2125551500', '2678 Kingston Rd.', 'Suite 101', 'NYC', 'NY', 10022, 'USA', 'NA', 'Frick', 'Michael', 'Small'),
 (10361, 20, Decimal('72.55'), 13, Decimal('1451.00'), '12/17/04 0:00', 'Shipped', 4, 12, 2004, 'Motorcycles', 95, 'S10_1678', 'Souveniers And Things Co.', '+61 2 9495 8555', 'Monitor Money Building, 815 Pacific Hwy', 'Level 6', 'Chatswood', 'NSW', 2067, 'Australia', 'APAC', 'Huxley', 'Adrian', 'Small'),
 (10163, 21, Decimal('100.00'), 1, Decimal('4860.24'), '10/20/03 0:00', 'Shipped', 4, 10, 2003, 'Classic Cars', 214, 'S10_1949', 'Classic Legends Inc.', '2125558493', '5905 Pompton St.', 'Suite 750', 'NYC', 'NY', 10022, 'USA', 'NA', 'Hernandez', 'Maria', 'Medium'),
 (10270, 21, Decimal('100.00'), 9, Decimal('4905.39'), '07/19/04 0:00', 'Shipped', 3, 7, 2004, 'Classic Cars', 214, 'S10_1949', 'Souveniers And Things Co.', '+61 2 9495 8555', 'Monitor Money Building, 815 Pacific Hwy', 'Level 6', 'Chatswood', 'NSW', 2067, 'Australia', 'APAC', 'Huxley', 'Adrian', 'Medium')]

# Business Questions To Answer

### How many unique cities does the data have?

In [5]:
%sql Select distinct city from SALES

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('Chatswood',), ('Melbourne',), ('NYC',), ('North Sydney',)]

### How many unique product lines does the data have?

In [5]:
%sql Select count(distinct productline) from SALES;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[(7,)]

### What is the most selling product line?

In [6]:
%sql Select productline, count(productline) AS CNT from SALES group by productline order by CNT desc;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('Classic Cars', 96),
 ('Vintage Cars', 55),
 ('Motorcycles', 37),
 ('Trucks and Buses', 32),
 ('Planes', 21),
 ('Ships', 6),
 ('Trains', 3)]

### What is the total sales by month?

In [8]:
%sql Select month_id, sum(sales) AS Total_sales from SALES group by month_id order by Total_sales desc;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[(11, Decimal('248566.01')),
 (12, Decimal('143927.76')),
 (4, Decimal('101678.19')),
 (7, Decimal('92946.58')),
 (6, Decimal('68462.15')),
 (5, Decimal('53709.61')),
 (2, Decimal('49637.57')),
 (9, Decimal('47191.76')),
 (1, Decimal('36716.22')),
 (3, Decimal('35160.25')),
 (10, Decimal('25284.75'))]

### What product line had the largest sales??

In [9]:
%sql Select productline, sum(sales) as Total_sales from SALES group by productline order by Total_sales desc;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('Classic Cars', Decimal('379958.23')),
 ('Vintage Cars', Decimal('199436.24')),
 ('Trucks and Buses', Decimal('120698.50')),
 ('Motorcycles', Decimal('116738.31')),
 ('Planes', Decimal('63772.09')),
 ('Ships', Decimal('15146.83')),
 ('Trains', Decimal('7530.65'))]

### What is the city with the largest sales?

In [11]:
%sql Select city, sum(sales) as Total_sales from SALES group by city order by Total_sales desc;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('NYC', Decimal('396718.33')),
 ('Melbourne', Decimal('200995.41')),
 ('North Sydney', Decimal('153996.13')),
 ('Chatswood', Decimal('151570.98'))]

### What year has the largest sales?

In [12]:
%sql Select year_id, sum(sales) AS Total_sales from SALES group by year_id order by Total_sales desc;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[(2004, Decimal('427075.74')),
 (2003, Decimal('367221.26')),
 (2005, Decimal('108983.85'))]

### Which state sold more products than average product sold?

In [13]:
%sql Select state, sum(quantityordered) AS Total_quantity from SALES group by state having sum(quantityordered) >(Select AVG(quantityordered) from sales);

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('NSW', 3070), ('NY', 3663), ('Victoria', 1926)]

### Total sales for each order?

In [18]:
%sql SELECT ORDERNUMBER, SUM(SALES) AS TotalSales FROM sales GROUP BY ORDERNUMBER ORDER BY TotalSales DESC LIMIT 5;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[(10127, Decimal('68462.15')),
 (10204, Decimal('64316.09')),
 (10324, Decimal('56372.87')),
 (10120, Decimal('50397.66')),
 (10223, Decimal('49637.57'))]

### Total sales by quarter?

In [19]:
%sql SELECT YEAR_ID, QTR_ID, SUM(SALES) AS TotalSales FROM SALES GROUP BY YEAR_ID, QTR_ID ORDER BY YEAR_ID, QTR_ID;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[(2003, 1, Decimal('6864.05')),
 (2003, 2, Decimal('153375.40')),
 (2003, 3, Decimal('75589.02')),
 (2003, 4, Decimal('131392.79')),
 (2004, 1, Decimal('49637.57')),
 (2004, 2, Decimal('26503.12')),
 (2004, 3, Decimal('64549.32')),
 (2004, 4, Decimal('286385.73')),
 (2005, 1, Decimal('65012.42')),
 (2005, 2, Decimal('43971.43'))]

### Average quantity ordered and average price per unit?

In [20]:
%sql SELECT AVG(QUANTITYORDERED) AS AvgQuantityOrdered, AVG(PRICEEACH) AS AvgPricePerUnit FROM SALES;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[(34, Decimal('84.452960000000000000000000000'))]

### Top customers by total sales?

In [21]:
%sql SELECT CUSTOMERNAME, SUM(SALES) AS TotalSales FROM SALES GROUP BY CUSTOMERNAME ORDER BY TotalSales DESC LIMIT 10

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('Australian Collectors, Co.', Decimal('200995.41')),
 ('Muscle Machine Inc', Decimal('197736.94')),
 ("Anna's Decorations, Ltd", Decimal('153996.13')),
 ('Souveniers And Things Co.', Decimal('151570.98')),
 ('Vitachrome Inc.', Decimal('88041.26')),
 ('Classic Legends Inc.', Decimal('77795.20')),
 ('Microscale Inc.', Decimal('33144.93'))]

### Sales by deal size?

In [22]:
%sql SELECT DEALSIZE, SUM(SALES) AS TotalSales FROM SALES GROUP BY DEALSIZE;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('Large', Decimal('122861.35')),
 ('Medium', Decimal('556393.76')),
 ('Small', Decimal('224025.74'))]

### Sales by territory?

In [23]:
%sql SELECT TERRITORY, SUM(SALES) AS TotalSales FROM SALES GROUP BY TERRITORY;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('APAC', Decimal('506562.52')), ('NA', Decimal('396718.33'))]

### Total sales by product line and territory

In [24]:
%sql SELECT PRODUCTLINE, TERRITORY, SUM(SALES) AS TotalSales FROM SALES GROUP BY PRODUCTLINE, TERRITORY;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('Classic Cars', 'APAC', Decimal('161870.46')),
 ('Classic Cars', 'NA', Decimal('218087.77')),
 ('Motorcycles', 'APAC', Decimal('75476.67')),
 ('Motorcycles', 'NA', Decimal('41261.64')),
 ('Planes', 'APAC', Decimal('63772.09')),
 ('Ships', 'APAC', Decimal('1089.36')),
 ('Ships', 'NA', Decimal('14057.47')),
 ('Trains', 'NA', Decimal('7530.65')),
 ('Trucks and Buses', 'APAC', Decimal('66020.96')),
 ('Trucks and Buses', 'NA', Decimal('54677.54')),
 ('Vintage Cars', 'APAC', Decimal('138332.98')),
 ('Vintage Cars', 'NA', Decimal('61103.26'))]

### Total sales by deal size and territory

In [25]:
%sql SELECT DEALSIZE, TERRITORY, SUM(SALES) AS TotalSales FROM SALES GROUP BY DEALSIZE, TERRITORY;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('Large', 'APAC', Decimal('43810.20')),
 ('Large', 'NA', Decimal('79051.15')),
 ('Medium', 'APAC', Decimal('314428.92')),
 ('Medium', 'NA', Decimal('241964.84')),
 ('Small', 'APAC', Decimal('148323.40')),
 ('Small', 'NA', Decimal('75702.34'))]

### Top products by sales quantity?

In [26]:
%sql SELECT PRODUCTCODE, SUM(QUANTITYORDERED) AS TotalQuantityOrdered FROM SALES GROUP BY PRODUCTCODE ORDER BY TotalQuantityOrdered DESC LIMIT 10;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('S18_2949', 188),
 ('S18_3232', 186),
 ('S18_2238', 176),
 ('S24_2887', 174),
 ('S18_1367', 153),
 ('S24_3191', 150),
 ('S18_4933', 146),
 ('S12_1666', 145),
 ('S24_2766', 145),
 ('S24_1046', 145)]

### Total sales by country?

In [27]:
%sql SELECT COUNTRY, SUM(SALES) AS TotalSales FROM SALES GROUP BY COUNTRY ORDER BY TotalSales DESC;

 * ibm_db_sa://vlp83309:***@ea286ace-86c7-4d5b-8580-3fbfa46b1c66.bs2io90l08kqb1od8lcg.databases.appdomain.cloud:31505/bludb
Done.

[('Australia', Decimal('506562.52')), ('USA', Decimal('396718.33'))]

# Conclusion